-- Insert all possible combinations into time_slot table
INSERT INTO time_slot(week_type, day, lesson_number)
SELECT week_types, days, lesson_numbers
FROM unnest(ARRAY['ODD', 'EVEN', 'BOTH']) week_types
         CROSS JOIN unnest(ARRAY['MONDAY', 'TUESDAY', 'WEDNESDAY', 'THURSDAY', 'FRIDAY']) days
         CROSS JOIN unnest(ARRAY[1, 2, 3, 4, 5, 6, 7, 8]) lesson_numbers;

INSERT INTO users(email, password, role)
VALUES
    ('user@gmail.com', '$2a$10$MAwJpDfT9Nib2X3LahpD7eqsCHz6XUXfWThHSREmwRjE4oX9UDNY2', 'USER'),
    ('user_2@gmail.com', '$2a$10$EKauRMWhRGAZ94eeARfOfeRx58TlLxCRjLzkzmpK/e3qkoARmlEL2', 'USER');

INSERT INTO subject(name, user_id)
VALUES
    ('Українська мова (письмо)', 1), ('Українська мова (читання)', 1), ('Англійська мова', 1),
    ('Математика', 1), ('Я досліджую світ', 1), ('Дизайн і технології', 1),
    ('Образотворче мистецтво', 1), ('Фізична культура', 1), ('Інформатика', 1),
    ('Українська мова', 1), ('Українська література', 1), ('Німецька мова', 1),
    ('Зарубіжна література', 1), ('Природознавство', 1), ('Історія', 1),
    ('Трудове навчання', 1), ('Музика', 1), ('Основи здоров`я', 1),
    ('Географія', 1), ('Фізика', 1), ('Хімія', 1),
    ('Історія України', 1), ('Всесвітня історія', 1), ('Біологія', 1),
    ('Правознавство', 1), ('Захист Вітчизни', 1), ('Предмети 1-4 класів', 1);


INSERT INTO room(name, capacity, user_id)
VALUES
    ('Спортивний зал №1', 78, 1), ('Спортивний зал №2', 60, 1),
    ('Хімічний кабінет', 40, 1), ('Фізичний кабінет', 38, 1),
    ('Комп`ютерний клас №1', 36, 1), ('Комп`ютерний клас №2', 37, 1);


INSERT INTO teacher(name, max_hours_per_week, user_id)
VALUES
('Чернихівська З.Д.', 17, 1), ('Маньковська О.А', 17, 1), ('Тищик Е.Р.', 17, 1),
('Чижевська Я.Д.', 17, 1), ('Бучко Х.Д.', 17, 1), ('Ковч Т.О.', 17, 1),
('Осадчук І.У.', 18, 1), ('Мокрицька Ч.Л.', 18, 1), ('Білан У.А.', 18, 1),
('Сінчук Д.О.', 18, 1), ('Маляр С.І.', 18, 1), ('Гуцало А.Б.', 18, 1),
('Англ вчитель 1-4 класи №1', 17, 1), ('Англ вчитель 1-4 класи №2', 16, 1),
('Фізра вчитель 1-4 класи №1', 18, 1), ('Фізра вчитель 1-4 класи №2', 18, 1);

/*('Вірський Єгор', 20, 1), ('Залужний Юрій', 22, 1), ('Яросевич Едуард', 19, 1),
('Гармаш Йосип', 23, 1), ('Сенько Євген', 25, 1), ('Пащук Федір', 20, 1),
('Семашко Яр', 19, 1), ('Кармалюк Орест', 22, 1), ('Чубатенко Ян', 20, 1),
('Мудениця Захар', 25, 1), ('Ярчук Шерлок', 22, 1), ('Балі Юхим', 21, 1);*/


INSERT INTO teacher_subject(teacher_id, subject_id)
VALUES
(1, 27), (2, 27) ,(3, 27) ,(4, 27) ,(5, 27), (6, 27),
(7, 27), (8, 27), (9, 27), (10, 27), (11, 27), (12, 27),
(13, 3), (14, 3), (15, 8), (16, 8);
-- TODO: is not valid for no
-- (1, 1), (1, 2), (2, 3), (2, 12), (3, 17),
-- (4, 6), (4, 9), (5, 4), (5, 17), (6, 16),
-- (7, 4), (8, 8), (9, 5), (9, 7), (9, 15),
-- (10, 10), (10, 11), (11, 13), (12, 14);


INSERT INTO class_group(grade_number, letter, shift, teacher_id, user_id)
VALUES
(1, 'А', 1, 1, 1), (1, 'Б', 1, 2, 1), (1, 'В', 1, 3, 1),
(2, 'А', 2, 4, 1), (2, 'Б', 2, 5, 1), (2, 'В', 2, 6, 1),
(3, 'А', 1, 7, 1), (3, 'Б', 1, 8, 1), (3, 'В', 1, 9, 1),
(4, 'А', 2, 10, 1), (4, 'Б', 2, 11, 1), (4, 'В', 2, 12, 1);/*,
(5, 'А', 1, X, 1), (5, 'Б', 1, X, 1), (5, 'В', 1, X, 1),
(6, 'А', 2, X, 1), (6, 'Б', 2, X, 1), (6, 'В', 2, X, 1),
(7, 'А', 2, X, 1), (7, 'Б', 2, X, 1), (7, 'В', 2, X, 1),
(8, 'А', 1, X, 1), (8, 'Б', 1, X, 1), (8, 'В', 1, X, 1),
(9, 'А', 1, X, 1), (9, 'Б', 1, X, 1), (9, 'В', 1, X, 1),
(10, 'А', 1, X, 1), (10, 'Б', 1, X, 1),
(11, 'А', 1, X, 1), (11, 'Б', 1, X, 1);*/


INSERT INTO group_limits(class_group_id, max_hours_per_week, combine_time_slot_id)
VALUES
(1, 22, null), (2, 22, null), (3, 22, null),
(4, 24, null), (5, 24, null), (6, 24, null),
(7, 25, null), (8, 25, null), (9, 25, null),
(10, 25, null), (11, 25, null), (12, 25, null);

INSERT INTO subject_limits(group_limits_id, subject_id, hours, teacher_id, room_id, teacher_2_id, room_2_id)
VALUES
(1, 1, 4, 1, null, null, null), (1, 2, 3, 1, null, null, null), (1, 3, 2, 13, null, null, null),
(1, 4, 4, 1, null, null, null), (1, 5, 3, 1, null, null, null), (1, 6, 1, 1, null, null, null),
(1, 7, 2, 1, null, null, null), (1, 8, 3, 15, 1, null, null);
--
-- (2, ),
-- (3, ),
-- (4, ),
-- (5, ),
-- (6, ),
-- (7, ),
-- (8, ),
-- (9, ),
-- (10, ),
-- (11, ),
-- (12, );
-- (1, 4, 2, 5, null, null, null)
